saved_forms/vidya-rel-550-MDP427with MD.xml

<?xml version="1.0" encoding="utf-8" ?>
<env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Body>
    <n1:DiscountServiceRequest xmlns:n1="http://schemas.gid.gap.com/discountService/v1">
      <RequestDateTime xsi:nil="true"></RequestDateTime>
      <StoreID xsi:nil="true"></StoreID>
      <RequestType>LIVE</RequestType>
      <orderRequest>
        <OrderID>1234</OrderID>
        <OrderDate>05/19/2009 9:00</OrderDate>
        <Channel>POS</Channel>
        <Brand>Gap</Brand>
        <Market>USA</Market>
        <OrderLineItems>
          <SequenceNumber>0</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>12300002002</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>14</ItemDivisionNumber>
            <ItemDepartmentNumber>145</ItemDepartmentNumber>
            <ItemClassNumber>04</ItemClassNumber>
            <ItemSubClassNumber>00</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>33.97</NetPrice>
            <PriceType>MARKDOWN</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
          <ManualDiscountApplied>2</ManualDiscountApplied>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>1</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>12300002001</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>14</ItemDivisionNumber>
            <ItemDepartmentNumber>145</ItemDepartmentNumber>
            <ItemClassNumber>08</ItemClassNumber>
            <ItemSubClassNumber>00</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>45</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>2</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>1230002003</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>12</ItemDivisionNumber>
            <ItemDepartmentNumber>129</ItemDepartmentNumber>
            <ItemClassNumber>08</ItemClassNumber>
            <ItemSubClassNumber>00</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>75</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>3</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>1230005101</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>12</ItemDivisionNumber>
            <ItemDepartmentNumber>129</ItemDepartmentNumber>
            <ItemClassNumber>03</ItemClassNumber>
            <ItemSubClassNumber>04</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>39.99</NetPrice>
            <PriceType>MARKDOWN</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
          <ManualDiscountApplied>1</ManualDiscountApplied>
        </OrderLineItems>
        <OrderLineItems>
          <SequenceNumber>4</SequenceNumber>
          <Product>
            <Brand>Gap</Brand>
            <Sku>1230005037</Sku>
            <ItemCorpNumber>01</ItemCorpNumber>
            <ItemCompanyNumber>1</ItemCompanyNumber>
            <ItemDivisionNumber>14</ItemDivisionNumber>
            <ItemDepartmentNumber>145</ItemDepartmentNumber>
            <ItemClassNumber>03</ItemClassNumber>
            <ItemSubClassNumber>01</ItemSubClassNumber>
            <MerchandiseType>7</MerchandiseType>
          </Product>
          <Price>
            <NetPrice>19.99</NetPrice>
            <PriceType>REGULAR</PriceType>
          </Price>
          <Quantity>1</Quantity>
          <Exclude>false</Exclude>
        </OrderLineItems>
        <Promotions>
          <SequenceNumber>0</SequenceNumber>
          <PromotionCode>ADULT15OFF</PromotionCode>
          <ReceiptMessages></ReceiptMessages>
          <PromoUsages></PromoUsages>
          <QualifyingTenders xsi:nil="true"></QualifyingTenders>
        </Promotions>
        <Promotions>
          <SequenceNumber>1</SequenceNumber>
          <PromotionCode>10OFFREGLR</PromotionCode>
          <ReceiptMessages></ReceiptMessages>
          <PromoUsages></PromoUsages>
          <QualifyingTenders xsi:nil="true"></QualifyingTenders>
        </Promotions>
        <Promotions>
          <SequenceNumber>2</SequenceNumber>
          <PromotionCode>ADULT30POF</PromotionCode>
          <ReceiptMessages></ReceiptMessages>
          <PromoUsages></PromoUsages>
          <QualifyingTenders xsi:nil="true"></QualifyingTenders>
        </Promotions>
        <Promotions>
          <SequenceNumber>3</SequenceNumber>
          <PromotionCode>10OFFSWEAT</PromotionCode>
          <ReceiptMessages></ReceiptMessages>
          <PromoUsages></PromoUsages>
          <QualifyingTenders xsi:nil="true"></QualifyingTenders>
        </Promotions>
        <Promotions>
          <SequenceNumber>4</SequenceNumber>
          <PromotionCode>10OOFMKDWN</PromotionCode>
          <ReceiptMessages></ReceiptMessages>
          <PromoUsages></PromoUsages>
          <QualifyingTenders xsi:nil="true"></QualifyingTenders>
        </Promotions>
        <Tenders>
          <CreditCardHash>Gu4qs0KFLdcr6ZqsAhzfr8c7KIp3YeU/4cgEDvKwx+M=</CreditCardHash>
          <CreditCardType>Gap Card</CreditCardType>
        </Tenders>
        <MaxDiscountsAllowed>2</MaxDiscountsAllowed>
      </orderRequest>
    </n1:DiscountServiceRequest>
  </env:Body>
</env:Envelope>